Services/src/InformationRegisters/С_РегистрацияСервисов/С_РегистрацияСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>С_РегистрацияСервисов</name>
  <resources>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДействияС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>STATUS</name>
    <type>
      <types>EnumRef.СтатусыСервисовИТС</types>
    </type>
  </resources>
  <attributes>
    <name>IDCUSTOMER</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDREQUEST</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAMECUSTOMER</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Extra</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПользовательСервиса</name>
    <type>
      <types>CatalogRef.С_ПользователиСервисов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.С_Сервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.С_Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDDOCREQUEST</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDSERVICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDSERVICEVA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Services/src/Enums/СтатусыСервисовИТС/СтатусыСервисовИТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСервисовИТС</name>
  <enumValues>
    <name>Активирован</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Деактивирован</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
</mdclass:Enum>

Services/src/Catalogs/С_ПользователиСервисов/С_ПользователиСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>С_ПользователиСервисов</name>
  <attributes>
    <name>УНП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерОсновнойПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Services/src/CommonModules/С_ИТСМеждународныйСервер/Module.bsl
Функция НайтиСервис(СтруктураПараметров) Экспорт
	
	INN = С_ИТССервисыСлужебныеПроцедурыФункции.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров.INN, ";");
	REGNUMBERS = С_ИТССервисыСлужебныеПроцедурыФункции.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров.REGNUMBERS, ";");
	NAMECUSTOMER = С_ИТССервисыСлужебныеПроцедурыФункции.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров.NAMECUSTOMER, ";");
	IDSERVICE = С_ИТССервисыСлужебныеПроцедурыФункции.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров.IDSERVICE, ";");	
	IDSERVICEVA = С_ИТССервисыСлужебныеПроцедурыФункции.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров.IDSERVICEVA, ";");	
	
	// //////////
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("IDCUSTOMER",   СтруктураПараметров.IDCUSTOMER);
	СтруктураПоиска.Вставить("IDDOCREQUEST", СтруктураПараметров.IDDOCREQUEST);
	СтруктураПоиска.Вставить("IDSERVICEVA",  СтруктураПараметров.IDSERVICEVA);	
	СтруктураПоиска.Вставить("DATEBEGIN",    Дата(СтруктураПараметров.DATEBEGIN));
	СтруктураПоиска.Вставить("DATEEND",      Дата(СтруктураПараметров.DATEEND));	
	СтруктураПоиска.Вставить("IDCUSTOMER",   СтруктураПараметров.IDCUSTOMER);	
	
	СтруктураПоиска.Вставить("IDSERVICE",    IDSERVICE);		
	СтруктураПоиска.Вставить("REGNUMBER",    REGNUMBERS);
	СтруктураПоиска.Вставить("NAMECUSTOMER", NAMECUSTOMER);	
	СтруктураПоиска.Вставить("INN",          INN);
	СтруктураПоиска.Вставить("PARTNERCODE",  СтруктураПараметров.PARTNERCODE);
	СтруктураПоиска.Вставить("IDSERVICEVA",  IDSERVICEVA);
	
	СтруктураПараметров.Вставить("INN",INN);	
	СтруктураПараметров.Вставить("IDSERVICE",IDSERVICE);
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СервисИТС.STATUS КАК status,
	|	СервисИТС.IDSERVICE КАК idservice,
	|	СервисИТС.ДатаДействияС КАК datebegin,
	|	СервисИТС.ДатаДействияПо КАК dateend,
	|	СервисИТС.IDCUSTOMER КАК idcustomer,
	|	СервисИТС.IDDOCREQUEST КАК iddocrequest,
	|	СервисИТС.IDREQUEST КАК idrequest,
	|	СервисИТС.IDSERVICEVA КАК IDSERVICEVA,
	|	СервисИТС.NAMECUSTOMER КАК namecustomer,
	|	СервисИТС.Партнер.PARTNERCODE КАК partnercode,
	|	СервисИТС.ПользовательСервиса.УНП КАК inn,
	|	СервисИТС.ПользовательСервиса.РегистрационныйНомерОсновнойПоставки КАК regnumbers,
	|	СервисИТС.ПользовательСервиса,
	|	СервисИТС.Сервис,
	|	СервисИТС.Партнер,
	|	СервисИТС.Сервис.ИмяПредопределенныхДанных
	|ИЗ
	|	РегистрСведений.С_РегистрацияСервисов КАК СервисИТС
	|ГДЕ
	|	СервисИТС.Extra = ЛОЖЬ
	|	И СервисИТС.IDDOCREQUEST = &IDDOCREQUEST
	//|	И СервисИТС.IDSERVICEVA = &IDSERVICEVA
	|	И СервисИТС.IDSERVICE В(&IDSERVICE)
	|	И СервисИТС.Партнер.PARTNERCODE = &PARTNERCODE
	|	И СервисИТС.NAMECUSTOMER В(&NAMECUSTOMER)
	|	И СервисИТС.ДатаДействияС >= &DATEBEGIN
	|	И СервисИТС.ДатаДействияПо <= &DATEEND
	|	И СервисИТС.ПользовательСервиса.РегистрационныйНомерОсновнойПоставки В(&REGNUMBER)
	|	И СервисИТС.ПользовательСервиса.УНП В(&INN)
	|	И СервисИТС.IDCUSTOMER = &IDCUSTOMER
	|	И СервисИТС.Сервис.ИмяПредопределенныхДанных В(&IDSERVICEVA)";
	
	Если СтруктураПоиска.REGNUMBER.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.ПользовательСервиса.РегистрационныйНомерОсновнойПоставки В(&REGNUMBER)", "");
	Иначе
		Запрос.УстановитьПараметр("REGNUMBER", СтруктураПоиска.REGNUMBER);
	КонецЕсли;	
	
	Если СтруктураПоиска.REGNUMBER.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.ПользовательСервиса.РегистрационныйНомерОсновнойПоставки В(&REGNUMBER)", "");
	Иначе
		Запрос.УстановитьПараметр("REGNUMBER", СтруктураПоиска.REGNUMBER);
	КонецЕсли;	
	
	Если  СтруктураПоиска.INN.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.ПользовательСервиса.УНП В(&INN)", "");
	Иначе
		Запрос.УстановитьПараметр("INN", СтруктураПоиска.INN);
	КонецЕсли;
	
	Если СтруктураПоиска.IDSERVICE.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.IDSERVICE В(&IDSERVICE)", "");
	Иначе
		Запрос.УстановитьПараметр("IDSERVICE", СтруктураПоиска.IDSERVICE);
	КонецЕсли;
	
	Если СтруктураПоиска.IDSERVICEVA.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.Сервис.ИмяПредопределенныхДанных В(&IDSERVICEVA)", "");
	Иначе
		Запрос.УстановитьПараметр("IDSERVICEVA", СтруктураПоиска.IDSERVICEVA);
	КонецЕсли;
	
	
	Если СтруктураПоиска.NAMECUSTOMER.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.NAMECUSTOMER В(&NAMECUSTOMER)", "");
	Иначе
		Запрос.УстановитьПараметр("NAMECUSTOMER", СтруктураПоиска.NAMECUSTOMER);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураПоиска.IDDOCREQUEST) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.IDDOCREQUEST = &IDDOCREQUEST", "");
	Иначе
		Запрос.УстановитьПараметр("IDDOCREQUEST", СтруктураПоиска.IDDOCREQUEST);
	КонецЕсли;	
		
	Если Не ЗначениеЗаполнено(СтруктураПоиска.PARTNERCODE) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.Партнер.PARTNERCODE = &PARTNERCODE", "");
	Иначе
		Запрос.УстановитьПараметр("PARTNERCODE", СтруктураПоиска.PARTNERCODE);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураПоиска.DATEBEGIN) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.ДатаДействияС >= &DATEBEGIN", "");
	Иначе
		Запрос.УстановитьПараметр("DATEBEGIN", СтруктураПоиска.DATEBEGIN);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СтруктураПоиска.DATEEND) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.ДатаДействияПо <= &DATEEND", "");
	Иначе
		Запрос.УстановитьПараметр("DATEEND", СтруктураПоиска.DATEEND);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СтруктураПоиска.IDCUSTOMER) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СервисИТС.IDCUSTOMER = &IDCUSTOMER", "");
	Иначе
		Запрос.УстановитьПараметр("IDCUSTOMER", СтруктураПоиска.IDCUSTOMER);
	КонецЕсли;
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		Возврат РезультатЗапроса;
	Исключение
		//ИТССервисыСлужебныеПроцедурыФункции.ОтослатьПисьмо("НайтиСервис", СтруктураПараметров.ТелоЗапроса, ОписаниеОшибки());
		Возврат Неопределено                               
    КонецПопытки;		
	
КонецФункции	

Процедура ДобавитьСервис(ПользовательСервиса, Сервис, СтруктураПодключения, Отказ)Экспорт
	
	Партнер = Справочники.С_Партнеры.НайтиПоНаименованию(СтруктураПодключения.PARTNERCODE);
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		ПартнерОбъект = Справочники.С_Партнеры.СоздатьЭлемент();
		ПартнерОбъект.Наименование = СтруктураПодключения.PARTNERCODE;
		ПартнерОбъект.PARTNERCODE =  СтруктураПодключения.PARTNERCODE;
		ПартнерОбъект.Записать();
		Партнер = ПартнерОбъект.Ссылка;
	КонецЕсли;
	
	НаборДанных = РегистрыСведений.С_РегистрацияСервисов.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(ПользовательСервиса) Тогда
		НаборДанных.Отбор.ПользовательСервиса.Установить(ПользовательСервиса);
	КонецЕсли;
	
	НаборДанных.Отбор.IDDOCREQUEST.Установить(СтруктураПодключения.IDDOCREQUEST);
	
	Если ЗначениеЗаполнено(Сервис.ИмяПредопределенныхДанных) тогда
		НаборДанных.Отбор.IDSERVICEVA.Установить(Сервис.ИмяПредопределенныхДанных);
	КонецЕсли;
	
	Если Не Партнер.Пустая() Тогда
		НаборДанных.Отбор.Партнер.Установить(Партнер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сервис) Тогда
		НаборДанных.Отбор.Сервис.Установить(Сервис);
	КонецЕсли;
	
	НаборДанных.Прочитать();	
	
	Если НаборДанных.Количество() > 0 Тогда
		НовСтр = НаборДанных[0];
	Иначе
		НовСтр = НаборДанных.Добавить();
		НовСтр.IDSERVICE = Новый УникальныйИдентификатор();	
	КонецЕсли;
	
	Если ЭтоБесплатныйСервис(Сервис)   Тогда
		НовСтр.Включен = Истина;
		НовСтр.STATUS = Перечисления.СтатусыСервисовИТС.Активирован;
	Иначе
		НовСтр.Включен = Ложь;
		НовСтр.STATUS = Перечисления.СтатусыСервисовИТС.Принято;
	КонецЕсли;
	
	СтруктураПодключения.Вставить("STATUS", НовСтр.STATUS);
	
	НовСтр.ПользовательСервиса = ПользовательСервиса;
	НовСтр.Сервис = Сервис;		
	Попытка
		НовСтр.ДатаДействияС = Дата(СтруктураПодключения.DATEBEGIN);
		НовСтр.ДатаДействияПо = Дата(СтруктураПодключения.DATEEND);
	Исключение	
		//ИТССервисыСлужебныеПроцедурыФункции.ОтослатьПисьмо("ДобавитьСервис", СтруктураПодключения.телоЗапроса, ОписаниеОшибки());
	КонецПопытки;			
	НовСтр.Партнер = Партнер;	
	НовСтр.IDDOCREQUEST = СтруктураПодключения.IDDOCREQUEST;
	НовСтр.IDSERVICEVA = Сервис.ИмяПредопределенныхДанных;
	НовСтр.IDREQUEST = СтруктураПодключения.IDREQUEST;
	НовСтр.NAMECUSTOMER = СтруктураПодключения.NAMECUSTOMER;
	НовСтр.IDCUSTOMER = СтруктураПодключения.IDCUSTOMER;

	СтруктураПодключения.Вставить("IDSERVICE", НовСтр.IDSERVICE);
	Попытка
		НаборДанных.Записать(Истина);
	Исключение
	//	ИТССервисыСлужебныеПроцедурыФункции.ОтослатьПисьмо("ДобавитьСервис", СтруктураПодключения.ТелоЗапроса, ОписаниеОшибки());
		Отказ = истина
	КонецПопытки;	
КонецПроцедуры	

Функция ПолучитьПользователяСервисов(РегНомер, УНП, ОргНаименование) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	С_ПользователиСервисов.Ссылка  КАК Пользователь
		|ИЗ
		|	Справочник.С_ПользователиСервисов КАК С_ПользователиСервисов
		|ГДЕ
		|	С_ПользователиСервисов.УНП = &УНП
		|	И С_ПользователиСервисов.РегистрационныйНомерОсновнойПоставки = &РегНомер
		|";
	Запрос.УстановитьПараметр("РегНомер", РегНомер);
	Запрос.УстановитьПараметр("УНП", УНП);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Попытка 
			Пользователь = Справочники.С_ПользователиСервисов.СоздатьЭлемент();
			Пользователь.УНП = УНП;
			Пользователь.Наименование = ОргНаименование;
			Пользователь.РегистрационныйНомерОсновнойПоставки = РегНомер;
			Пользователь.РегистрационныйНомерКонфигурации = РегНомер;
			Пользователь.НаименованиеОрганизации = ОргНаименование;
			Пользователь.Записать(); 
			Возврат  Пользователь.Ссылка;
		Исключение
			Возврат Неопределено;
		КонецПопытки;			
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();		
		ПользовательСервиса = Выборка.Пользователь;
		Возврат  Выборка.Пользователь
	КонецЕсли;
	
КонецФункции	

Функция ЭтоБесплатныйСервис(Сервис)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сервисы.Ссылка,
		|	Сервисы.БесплатныйСервис  КАК  БесплатныйСервис
		|ИЗ
		|	Справочник.Сервисы КАК Сервисы
		|ГДЕ
		|	Сервисы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Сервис);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат   ВыборкаДетальныеЗаписи.БесплатныйСервис;
	КонецЦикла;
		
КонецФункции
